<?php
/**
 * Created by PhpStorm.
 * User: jiaruo
 * Date: 17/2/15
 * Time: 下午2:05
 */
return array(
    'msg'   =>  array(
        '-1'    => "网络连接失败,出现未知错误",
        '-2'    =>  '用户不存在,或密码错误',
        '-3'    =>  '不能登录,请联系介绍人',
        '-4'    =>  '手机号已被注册',
        '-5'    =>  '推荐人不存在',
        '-6'    =>  '验证码错误',
        '-7'    =>  '修改密码失败',
        '-8'    =>  '验证码发送失败',
        '-9'    =>  '登录已过期,请重新登录',
        '-10'   =>  '旧密码错误',
        '-11'   =>  '天鹅蛋不足',
        '-12'   =>  '超出购买限制',
        '-13'   =>  '好友不存在',
        '-14'   =>  '需要330只鸡才可以激活伙伴账户!',
        '-15'   =>  '饲料不足,请购买饲料',
        '-16'   =>  '小鸡产蛋中，请稍候喂养',
        '-17'   =>  "会员不存在",
        '-18'   =>  '小天鹅还在在喂养中',
        '-19'   =>  '天鹅蛋不足',
        '-20'   =>  '该订单不存在',
		'-21'	=>	'发送失败',
		'-22'	=>	'余额不足',
		'-23'	=>	'银行资料不足',
		'-24'	=>	'违规操作,账号暂时冻结',
		'-25'	=>	'充值金额必须50的倍数',
		'-26'	=>	'提现金额最少10元并且是10的倍数',
        '-27'   =>  '小鸡数量不足！',
        '-28'   =>  '请指定孵化土地！',
        10000   =>  '成功',
        10001   =>  '数据为空',
        '-10000'=>  '系统正在拆分,请稍后再操作！'
    ),
);